bit-finance/DataProcessors/бит_ПривязкаПланируемогоПоступленияДСКФактическому.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бит_ПривязкаПланируемогоПоступленияДСКФактическому</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

bit-finance/Documents/бит_ОтражениеФактаДДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_ОтражениеФактаДДС</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НеСинхронизировать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеБезналичныхДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетБанкаПоОперациямЭквайринга</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеБезналичныхДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_СценарииПланирования</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачатПереходНаНовуюАрхитектуру</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКурсДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКратностьДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УдалитьХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеСинхронизироватьСумму</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеСинхронизироватьПериод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ФактическиеДанные</Name>
					<Comment>Фактические данные</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦФО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяОборотов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СтатьиОборотов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_1</Name>
							<Comment>Дополнительная аналитика № 1</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_2</Name>
							<Comment>Дополнительная аналитика № 2</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_3</Name>
							<Comment>Дополнительная аналитика № 3</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_4</Name>
							<Comment>Дополнительная аналитика № 4</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_5</Name>
							<Comment>Дополнительная аналитика № 5</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_6</Name>
							<Comment>Дополнительная аналитика № 6</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_7</Name>
							<Comment>Дополнительная аналитика № 7</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_8</Name>
							<Comment>Дополнительная аналитика № 8</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_9</Name>
							<Comment>Дополнительная аналитика № 9</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_10</Name>
							<Comment>Дополнительная аналитика № 10</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_11</Name>
							<Comment>Дополнительная аналитика № 11</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_12</Name>
							<Comment>Дополнительная аналитика № 12</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Позиция</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.бит_кзн_ПозицияПоступления</v8:Type>
								<v8:Type>cfg:DocumentRef.бит_кзн_ПлатежнаяПозиция</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заблокировать</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВзаиморасчетов</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаВзаиморасчетов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КурсЧислительВзаиморасчетов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КурсЗнаменательВзаиморасчетов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Аналитики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Аналитика</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыДополнительныхАналитик</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеАналитики</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаборыЗначенийДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерНабора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДоступа</Name>
							<Comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеДоступа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уточнение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Чтение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изменение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

bit-finance/DataProcessors/бит_ПривязкаПланируемогоПоступленияДСКФактическому/Forms/ПривязкаДокументов/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПодготовитьФормуНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОбластьПоискаДокументовПриИзменении(Элемент)
	
	ОбластьПоискаДокументовПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПравилОтбораНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПоказатьФормуНастроек("Отборы");
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПравилПоискаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПоказатьФормуНастроек("Поиск");
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодДатаНачалаПриИзменении(Элемент)
	
	ПриИзмененииНастроекОтбораИПоиска();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодДатаОкончанияПриИзменении(Элемент)
	
	ПриИзмененииНастроекОтбораИПоиска();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

&НаКлиенте
Процедура СвязанныеДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле <> Элементы.СвязанныеДокументыПометка Тогда
		ТекущиеДанные = СвязанныеДокументы.НайтиПоИдентификатору(ВыбраннаяСтрока);
		ПоказатьЗначение(, ТекущиеДанные.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеДокументыПометкаПриИзменении(Элемент)
	
	ПометитьПривязанныйДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеДокументыПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("СвязанныеДокументыПриАктивизацииСтрокиОжидание", 0.5, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоказатьНастройки(Команда)
	
	ПоказатьФормуНастроек();

КонецПроцедуры

&НаКлиенте
Процедура НайтиДокументы(Команда)
	
	НачатьЗаполнениеСвязанныхДокументов();
	
КонецПроцедуры

// Обработчик завершения выбора диалога ввода даты.
//  См. Синтакс-помощник: ПоказатьОповещениеПользователя().
//
&НаКлиенте
Процедура НайтиДокументыЗавершение(Дополнительно) Экспорт

	ПоказатьФормуНастроек();	

КонецПроцедуры

&НаКлиенте
Процедура ПривязатьДокументы(Команда)
	
	НачатьПривязкуДокументов();
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ВыбратьПериод(Команда)
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период = Период;
	
	Ответ = Ждать Диалог.РедактироватьАсинх();
	Если Ответ <> Неопределено Тогда
		Период = Ответ;
		ПриИзмененииНастроекОтбораИПоиска();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьГруппу(Команда)
	
	РазвернутьСвязанныеДокументыИерархически();
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьГруппу(Команда)
	
	СвернутьСвязанныеДокументыИерархически();
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометки(Команда)
	
	СнятьПометкиИерархически(СвязанныеДокументы.ПолучитьЭлементы());
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ФоновоеЗаполнение

&НаКлиенте
Процедура НачатьЗаполнениеСвязанныхДокументов()

	ДлительнаяОперация = ЗапуститьФоновоеЗаполнениеСвязанныхДокументов();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ТекстСообщения 	   = НСтр("ru = 'Идет заполнение списка документов'"); 
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗаполненияСвязанныхДокументов", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОписаниеОповещения, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция ЗапуститьФоновоеЗаполнениеСвязанныхДокументов()
		
	// Заполнение пераметов длительной операции.
	НаименованиеЗадания = НСтр("ru = 'Заполнение связанных документов.'");
	ВыполняемыйМетод	= "Обработки.бит_ПривязкаПланируемогоПоступленияДСКФактическому.ОбновитьСвязанныеДокументы";

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	
	СхемаКомпоновки    		  = ПолучитьИзВременногоХранилища(АдресСхемыКомпоновки);
	НастройкиКомпоновкиДанных = КомпоновщикПредварительногоОтбора.ПолучитьНастройки();
	
	Если ЗначениеЗаполнено(Период) Тогда
		бит_ОтчетыБФКлиентСервер.УстановитьПараметр(НастройкиКомпоновкиДанных, "ДатаНачала", 	Период.ДатаНачала);
		бит_ОтчетыБФКлиентСервер.УстановитьПараметр(НастройкиКомпоновкиДанных, "ДатаОкончания", Период.ДатаОкончания);
	КонецЕсли;

	ДанныеФормы = Новый Структура;
	ДанныеФормы.Вставить("ПравилаПоиска",				   РеквизитФормыВЗначение("ПравилаПоиска"));
	ДанныеФормы.Вставить("СкрыватьДокументыБезПары",	   СкрыватьДокументыБезПары);
	ДанныеФормы.Вставить("АвтоПомечатьНаиболееПодходящие", АвтоПомечатьНаиболееПодходящие);
	
	ФоновоеЗадание = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, ВыполняемыйМетод, 
						СхемаКомпоновки, НастройкиКомпоновкиДанных, ДанныеФормы);
						
	Возврат ФоновоеЗадание;

КонецФункции

&НаСервере
Процедура ОбновитьСвязанныеДокументыНаСервере()
	
	КомпоновщикМакета  = Новый КомпоновщикМакетаКомпоновкиДанных;
	СхемаКомпоновки    = ПолучитьИзВременногоХранилища(АдресСхемыКомпоновки);
	Настройки 		   = КомпоновщикПредварительногоОтбора.ПолучитьНастройки();
	
	ДанныеФормы = Новый Структура;
	ДанныеФормы.Вставить("Период", 						   Период);
	ДанныеФормы.Вставить("ПравилаПоиска",				   РеквизитФормыВЗначение("ПравилаПоиска"));
	ДанныеФормы.Вставить("СкрыватьДокументыБезПары",	   СкрыватьДокументыБезПары);
	ДанныеФормы.Вставить("АвтоПомечатьНаиболееПодходящие", АвтоПомечатьНаиболееПодходящие);

	Результат = Обработки.бит_ПривязкаПланируемогоПоступленияДСКФактическому.ОбновитьСвязанныеДокументы(СхемаКомпоновки, 
					Настройки, ДанныеФормы);
					
	ЗначениеВРеквизитФормы(Результат, "СвязанныеДокументы");				
	
КонецПроцедуры

// Обработка оповещения. Подробности см.ДлительныеОперацииКлиент.ОжидатьЗавершение.
//
&НаКлиенте
Процедура ПослеЗаполненияСвязанныхДокументов(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Если Результат.Статус <> "Выполнено" Тогда
		ТекстСообщения = НСтр("ru = 'Ошибка при выполнении: %1'"); 
		ПоказатьПредупреждение(, СтрШаблон(ТекстСообщения, Результат.КраткоеПредставлениеОшибки));
	Иначе
		ПослеЗаполненияСвязанныхДокументовНаСервере(Результат.АдресРезультата);
		
		РазвернутьСвязанныеДокументыИерархически();
		Если СвязанныеДокументы.ПолучитьЭлементы().Количество() <> 0 Тогда
			УстановитьПодсказкуСпискаИКнопкуПоУмолчанию(ЭтотОбъект, "ВыполненПоиск");
		Иначе
			УстановитьПодсказкуСпискаИКнопкуПоУмолчанию(ЭтотОбъект, "Открытие");
			ТекстСообщения = НСтр("ru = 'Поиск не дал результата.'");
			Пояснение	   = НСтр("ru = 'Попробуйте изменить условия поиска.'");
			Оповещение 	   = Новый ОписаниеОповещения("НайтиДокументыЗавершение", ЭтотОбъект);
			ПоказатьОповещениеПользователя(ТекстСообщения, Оповещение, Пояснение);
		КонецЕсли;
	КонецЕсли; 

КонецПроцедуры

&НаСервере
Процедура ПослеЗаполненияСвязанныхДокументовНаСервере(АдресРезультата)
	
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	ЗначениеВРеквизитФормы(Результат, "СвязанныеДокументы");
		
КонецПроцедуры
	
#КонецОбласти

#Область ФоноваяПривязка

&НаКлиенте
Процедура НачатьПривязкуДокументов()

	Если СвязанныеДокументы.ПолучитьЭлементы().Количество() = 0 Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Список" , 
							"Заполнение",,,НСтр("ru = 'Связанные документы'"));
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "СвязанныеДокументы");
		Возврат;
	КонецЕсли;
	
	ЕстьВыбранные = Ложь;
	
	Стек = Новый Массив; 
	Для каждого СтрокаТаблицы Из СвязанныеДокументы.ПолучитьЭлементы() Цикл
		
		Стек.Добавить(СтрокаТаблицы);
	
		Пока Стек.Количество() > 0 Цикл
			
			ТекущийОбъект = Стек.Получить(Стек.ВГраница());
			Стек.Удалить(Стек.ВГраница());
			Если ТекущийОбъект.Пометка = Истина И ТекущийОбъект.Обработано = Ложь Тогда
				ЕстьВыбранные = Истина;
			КонецЕсли;

			Для каждого Элемент Из ТекущийОбъект.ПолучитьЭлементы() Цикл
				Стек.Добавить(Элемент);
			КонецЦикла; 
		КонецЦикла;
	КонецЦикла; 

	Если НЕ ЕстьВыбранные Тогда
		ТекстСообщения = НСтр("ru='Не выбраны документы для обработки.';
							  |en='Documents not selected for processing.'");
		ПоказатьПредупреждение(, ТекстСообщения, 30);
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	
	ДлительнаяОперация = ЗапуститьФоновуюПривязкуДокументов();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ТекстСообщения 	   = НСтр("ru = 'Идет обработка списка документов'"); 
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПривязкиДокументов", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОписаниеОповещения, ПараметрыОжидания);

КонецПроцедуры

// Обработка оповещения. Подробности см.ДлительныеОперацииКлиент.ОжидатьЗавершение.
//
&НаКлиенте
Процедура ПослеПривязкиДокументов(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		ПослеПривязкиДокументовНаСервере(Результат.АдресРезультата);
	Иначе
		ТекстСообщения = НСтр("ru = 'Ошибка при выполнении: %1'"); 
		ПоказатьПредупреждение(, СтрШаблон(ТекстСообщения, Результат.КраткоеПредставлениеОшибки));
	КонецЕсли; 

КонецПроцедуры

&НаСервере
Функция ЗапуститьФоновуюПривязкуДокументов()
	
	// Заполнение пераметов длительной операции.
	НаименованиеЗадания = НСтр("ru = 'Привязка ""Планируемого поступления ДС"" к документам рег. учета.'");
	ВыполняемыйМетод	= "Обработки.бит_ПривязкаПланируемогоПоступленияДСКФактическому.ПривязатьДокументы";

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	
	ФоновоеЗадание = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, ВыполняемыйМетод, 
							РеквизитФормыВЗначение("СвязанныеДокументы"));
	Возврат ФоновоеЗадание;

КонецФункции

&НаСервере
Процедура ПослеПривязкиДокументовНаСервере(АдресРезультата)

	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ОбработанныеСтроки 	 = Результат.ОбработанныеСтроки;
	ОбработаноДокументов = Результат.ОбработаноДокументов;
	ОбработаноСОшибкой 	 = Результат.ОбработаноСОшибкой;

	ЗначениеВРеквизитФормы(ОбработанныеСтроки, "СвязанныеДокументы");
	
	УстановитьПодсказкуСпискаИКнопкуПоУмолчанию(ЭтотОбъект, "ОбработкаЗавершена");

	ТекстСообщения = НСтр("ru = 'Обработка завершена. Обработано документов: %1, обработано с ошибкой: %2.'");
	ТекстСообщения = СтрШаблон(ТекстСообщения, ОбработаноДокументов, ОбработаноСОшибкой);
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);

КонецПроцедуры
	
#КонецОбласти

&НаКлиенте
Процедура ПометитьПривязанныйДокумент()

	ТекущиеДанные = Элементы.СвязанныеДокументы.ТекущиеДанные;	
	СтрокаРодитель = ТекущиеДанные.ПолучитьРодителя();
	Коллекция = СтрокаРодитель.ПолучитьЭлементы();
	Если Коллекция.Количество() > 1 Тогда
		Для каждого ЭлементКоллекции Из Коллекция Цикл
			Если ЭлементКоллекции.Ссылка <> ТекущиеДанные.Ссылка Тогда
				ЭлементКоллекции.Пометка = Ложь;			
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуНаСервере()

	ДоступныеОбластиПоиска = Новый Массив;
	ДоступныеОбластиПоиска.Добавить(Метаданные.Документы.ПоступлениеБезналичныхДенежныхСредств);
	ДоступныеОбластиПоиска.Добавить(Метаданные.Документы.ПриходныйКассовыйОрдер);
	
	СписокВыбора = Элементы.ОбластьПоискаДокументов.СписокВыбора;
	Для Каждого Элемент Из ДоступныеОбластиПоиска Цикл
		СписокВыбора.Добавить(Элемент.ПолноеИмя(), Элемент.Представление());
	КонецЦикла;
	
	ОбластьПоискаДокументов = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(ИмяФормы, "ОбластьПоискаДокументов", 
									СписокВыбора[0].Значение);
									
	Период		   = Новый СтандартныйПериод(ВариантСтандартногоПериода.ЭтотМесяц);
	НастройкиФормы = ПрочитатьНастройки();
	
	ИнициализироватьКомпоновщикОтбора(НастройкиФормы);
	
	УправлениеФормой();
	УстановитьУсловноеОформление();
	УстановитьПодсказкуСпискаИКнопкуПоУмолчанию(ЭтотОбъект, "Открытие");
	
КонецПроцедуры

&НаСервере
Процедура УправлениеФормой()

	// ++ NB управление реквизитами по метаданным. 	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СвязанныеДокументыДатаВходящегоДокумента",
		"Видимость", ОбластьПоискаДокументов = Метаданные.Документы.ПоступлениеБезналичныхДенежныхСредств.ПолноеИмя()); 
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СвязанныеДокументыНомерВходящегоДокумента",
		"Видимость", ОбластьПоискаДокументов = Метаданные.Документы.ПоступлениеБезналичныхДенежныхСредств.ПолноеИмя()); 
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СвязанныеДокументыНазначениеПлатежа",
		"Видимость", ОбластьПоискаДокументов = Метаданные.Документы.ПоступлениеБезналичныхДенежныхСредств.ПолноеИмя()); 

КонецПроцедуры

&НаСервере
Функция ПрочитатьНастройки()

	НастройкиФормыПоУмолчанию = НастройкиПривязкиПланируемогоПоступления();
	НастройкиФормы = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(ИмяФормы, ОбластьПоискаДокументов, НастройкиФормыПоУмолчанию);
	ЗаполнитьЗначенияСвойств(НастройкиФормыПоУмолчанию, НастройкиФормы);
	Возврат НастройкиФормыПоУмолчанию;

КонецФункции

&НаСервере
Процедура ИнициализироватьКомпоновщикОтбора(НастройкиФормы)

	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(ОбластьПоискаДокументов);
	
	СхемаКомпоновки = Обработки.бит_ПривязкаПланируемогоПоступленияДСКФактическому.ПолучитьМакет("ПредварительныйОтбор");
	
	ТекстыЗапросов = ТекстЗапросаОбъектаПоиска(ОбъектМетаданных); 
	СхемаКомпоновки.НаборыДанных[0].Запрос = ТекстыЗапросов[0];
	СхемаКомпоновки.НаборыДанных[1].Запрос = ТекстыЗапросов[1];
	
	АдресСхемыКомпоновки = ПоместитьВоВременноеХранилище(СхемаКомпоновки, УникальныйИдентификатор);
	
	КомпоновщикПредварительногоОтбора.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновки));
	КомпоновщикПредварительногоОтбора.ЗагрузитьНастройки(СхемаКомпоновки.НастройкиПоУмолчанию);
	
	ОтборыЗагружены = Ложь;
	НастройкиКД = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(НастройкиФормы, "НастройкиКД");
	Если ТипЗнч(НастройкиКД) = Тип("НастройкиКомпоновкиДанных") Тогда
		бит_ОтчетыБФКлиентСервер.СкопироватьЭлементы(КомпоновщикПредварительногоОтбора.Настройки.Отбор, НастройкиКД.Отбор);
		КомпоновщикПредварительногоОтбора.Восстановить();
		ОтборыЗагружены = Истина;
	КонецЕсли;

	// Отбор по пометке удаления.
	Если Не ОтборыЗагружены Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			КомпоновщикПредварительногоОтбора.Настройки.Отбор, "ПометкаУдаления", Ложь,
			ВидСравненияКомпоновкиДанных.Равно,, Ложь);
	КонецЕсли;

	ИницироватьПравилаПоиска();
	НастройкиПравилПоиска = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(НастройкиФормы, "ПравилаПоиска");
	
	Если ЗначениеЗаполнено(НастройкиПравилПоиска) Тогда
		Для каждого СтрокаТаблицы Из ПравилаПоиска Цикл
			РезультатПоиска = НастройкиПравилПоиска.Найти(СтрокаТаблицы.ВыражениеИсточник, "ВыражениеИсточник");
			Если РезультатПоиска <> Неопределено Тогда
				СтрокаТаблицы.Пометка = РезультатПоиска.Пометка;			
			КонецЕсли;			
		КонецЦикла;
	КонецЕсли;
	
	СкрыватьДокументыБезПары = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
								НастройкиФормы, "СкрыватьДокументыБезПары", Ложь);
								
	АвтоПомечатьНаиболееПодходящие = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
												НастройкиФормы, "АвтоПомечатьНаиболееПодходящие", Истина);
	
	СформироватьПредставлениеПравилОтбора();
	СформироватьПредставлениеПравилПоиска();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьПредставлениеПравилОтбора()
	
	ПредставлениеПравилОтбора = Строка(КомпоновщикПредварительногоОтбора.Настройки.Отбор);
	Если ПустаяСтрока(ПредставлениеПравилОтбора) Тогда
		ПредставлениеПравилОтбора = НСтр("ru = 'Все элементы'");
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура СформироватьПредставлениеПравилПоиска()

	НаборПравилПоиска = Новый Массив;
	Для каждого СтрокаТаблицы Из ПравилаПоиска Цикл
		Если СтрокаТаблицы.Пометка Тогда
			Представление = СтрШаблон("%1 %2 %3", СтрокаТаблицы.РеквизитДокумента, 
								СтрокаТаблицы.ВидСравнения, СтрокаТаблицы.РеквизитППДС); 
			НаборПравилПоиска.Добавить(Представление);
		КонецЕсли;
	КонецЦикла;

	Если ЗначениеЗаполнено(НаборПравилПоиска) Тогда
		ПредставлениеПравилПоиска = СтрСоединить(НаборПравилПоиска, " И ");
	Иначе	
		ПредставлениеПравилПоиска = НСтр("ru = 'Правила не определены'; en = 'The rules are not defined'");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьКомпоновщикОтбораИНастройки(АдресРезультата)

	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	УдалитьИзВременногоХранилища(АдресРезультата);
	
	НастройкиКомпоновщикаПредварительногоОтбора = Результат.НастройкиКомпоновщикаПредварительногоОтбора;
	КомпоновщикПредварительногоОтбора.ЗагрузитьНастройки(НастройкиКомпоновщикаПредварительногоОтбора);
	КомпоновщикПредварительногоОтбора.Восстановить();
		
	ЗначениеВРеквизитФормы(Результат.ПравилаПоиска, "ПравилаПоиска");

	СкрыватьДокументыБезПары 	   = Результат.СкрыватьДокументыБезПары;
	АвтоПомечатьНаиболееПодходящие = Результат.АвтоПомечатьНаиболееПодходящие;
	
	СформироватьПредставлениеПравилОтбора();
	СформироватьПредставлениеПравилПоиска();
	СохранитьПользовательскиеНастройки();
	
КонецПроцедуры

&НаСервере
Процедура СохранитьПользовательскиеНастройки()

	НастройкиФормы = НастройкиПривязкиПланируемогоПоступления();
	НастройкиФормы.ОбластьПоискаДокументов  = ОбластьПоискаДокументов;
	НастройкиФормы.НастройкиКД 			    = КомпоновщикПредварительногоОтбора.Настройки;
	НастройкиФормы.ПравилаПоиска 		    = ПравилаПоиска.Выгрузить();
	НастройкиФормы.СкрыватьДокументыБезПары = СкрыватьДокументыБезПары;
	
	НастройкиФормы.АвтоПомечатьНаиболееПодходящие = АвтоПомечатьНаиболееПодходящие;
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(ИмяФормы, "ОбластьПоискаДокументов", ОбластьПоискаДокументов);
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(ИмяФормы, ОбластьПоискаДокументов, НастройкиФормы);

КонецПроцедуры

&НаСервере
Функция НастройкиПривязкиПланируемогоПоступления()

	Результат = Новый Структура;
	Результат.Вставить("ОбластьПоискаДокументов", 		 "");
	Результат.Вставить("НастройкиКД",         	  		 Неопределено);
	Результат.Вставить("ПравилаПоиска",       	  		 Неопределено);
	Результат.Вставить("СкрыватьДокументыБезПары",		 Ложь);
	Результат.Вставить("АвтоПомечатьНаиболееПодходящие", Истина);
	
	Возврат Результат;

КонецФункции

&НаСервере
Функция АдресНастроек()

	Результат = Новый Структура;
	Результат.Вставить("НастройкиКомпоновщикаПредварительногоОтбора", КомпоновщикПредварительногоОтбора.Настройки);
	Результат.Вставить("ПравилаПоиска", РеквизитФормыВЗначение("ПравилаПоиска"));
	
	Возврат ПоместитьВоВременноеХранилище(Результат, УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Процедура ОбластьПоискаДокументовПриИзмененииНаСервере()
	
	СвязанныеДокументы.ПолучитьЭлементы().Очистить();
	УстановитьПодсказкуСпискаИКнопкуПоУмолчанию(ЭтотОбъект, "Открытие");

	НастройкиФормы = ПрочитатьНастройки();
	ИнициализироватьКомпоновщикОтбора(НастройкиФормы);	
	СохранитьПользовательскиеНастройки();
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьФормуНастроек(Закладка = "")
	
	ЭлементСписка = Элементы.ОбластьПоискаДокументов.СписокВыбора.НайтиПоЗначению(ОбластьПоискаДокументов);
	Если ЭлементСписка = Неопределено Тогда
		ПредставлениеОбластиОтбора = Неопределено;
	Иначе
		ПредставлениеОбластиОтбора = ЭлементСписка.Представление;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АдресСхемыКомпоновки",       	 АдресСхемыКомпоновки);
	ПараметрыФормы.Вставить("АдресНастроек", 			  	 АдресНастроек());
	ПараметрыФормы.Вставить("ИдентификаторОсновнойФормы", 	 УникальныйИдентификатор);
	ПараметрыФормы.Вставить("ПредставлениеОбластиОтбора", 	 ПредставлениеОбластиОтбора);
	ПараметрыФормы.Вставить("Закладка", 				  	 Закладка);
	ПараметрыФормы.Вставить("СкрыватьДокументыБезПары",   	 СкрыватьДокументыБезПары);
	ПараметрыФормы.Вставить("АвтоПомечатьНаиболееПодходящие",АвтоПомечатьНаиболееПодходящие);
	
	Обработчик = Новый ОписаниеОповещения("ПоказатьНастройкиЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("Обработка.бит_ПривязкаПланируемогоПоступленияДСКФактическому.Форма.ОтборыИНастройки", 
		ПараметрыФормы, ЭтотОбъект, , , , Обработчик);

КонецПроцедуры

// Обработчик завершения открытия формы.
//  См. Синтакс-помощник: ОткрытьФорму().
//
&НаКлиенте
Процедура ПоказатьНастройкиЗавершение(АдресРезультата, Дополнительно) Экспорт

	Если ТипЗнч(АдресРезультата) <> Тип("Строка") Или Не ЭтоАдресВременногоХранилища(АдресРезультата) Тогда
		Возврат;
	КонецЕсли;	

	ОбновитьКомпоновщикОтбораИНастройки(АдресРезультата);
	ПриИзмененииНастроекОтбораИПоиска();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииНастроекОтбораИПоиска()

	СвязанныеДокументы.ПолучитьЭлементы().Очистить();
	УстановитьПодсказкуСпискаИКнопкуПоУмолчанию(ЭтотОбъект, "ИзмененыПравилаОтбораИПоиска");

КонецПроцедуры

&НаСервере
Функция ТекстЗапросаОбъектаПоиска(ОбъектМетаданных)

	Если ОбъектМетаданных = Метаданные.Документы.ПоступлениеБезналичныхДенежныхСредств Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ФактическиеДанные.Ссылка КАК ОтражениеФакта,
		|	ФактическиеДанные.Ссылка.ДокументОснование КАК ДокументОснование
		|ПОМЕСТИТЬ ВТ_Распределение
		|ИЗ
		|	Документ.бит_ОтражениеФактаДДС.ФактическиеДанные КАК ФактическиеДанные
		|ГДЕ
		|	ФактическиеДанные.Позиция = НЕОПРЕДЕЛЕНО
		|	И ТИПЗНАЧЕНИЯ(ФактическиеДанные.Ссылка.ДокументОснование) = ТИП(Документ.ПоступлениеБезналичныхДенежныхСредств)
		|{ГДЕ
		|	(ФактическиеДанные.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)}
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Деньги.Ссылка КАК Ссылка,
		|	НАЧАЛОПЕРИОДА(Деньги.Дата, ДЕНЬ) КАК Дата,
		|	Деньги.Номер КАК Номер,
		|	Деньги.Проведен КАК Проведен,
		|	Деньги.СуммаДокумента КАК Сумма,
		|	Деньги.Валюта КАК Валюта,
		|	Деньги.Контрагент КАК Контрагент,
		|	Деньги.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	Деньги.Комментарий КАК Комментарий,
		|	Деньги.Подразделение КАК Подразделение,
		|	Деньги.Ответственный КАК Ответственный,
		|	Деньги.Организация КАК Организация,
		|	Деньги.БанковскийСчет КАК БанковскийСчетКасса,
		|	Деньги.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
		|	Деньги.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
		|	Деньги.НазначениеПлатежа КАК НазначениеПлатежа,
		|	ТИПЗНАЧЕНИЯ(Деньги.Ссылка) КАК Тип,
		|	Деньги.ПометкаУдаления КАК ПометкаУдаления,
		|	ВТ_Распределение.ОтражениеФакта КАК ОтражениеФакта
		|{ВЫБРАТЬ
		|	Ссылка.*,
		|	Дата,
		|	Номер,
		|	Проведен,
		|	Сумма,
		|	Валюта.*,
		|	Контрагент.*,
		|	ХозяйственнаяОперация.*,
		|	Комментарий,
		|	Подразделение.*,
		|	Ответственный.*,
		|	Организация.*,
		|	БанковскийСчетКасса.* КАК БанковскийСчетКасса,
		|	ДатаВходящегоДокумента,
		|	НомерВходящегоДокумента,
		|	НазначениеПлатежа,
		|	Тип,
		|	ПометкаУдаления,
		|	ОтражениеФакта.*}
		|ИЗ
		|	Документ.ПоступлениеБезналичныхДенежныхСредств КАК Деньги
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Распределение КАК ВТ_Распределение
		|		ПО Деньги.Ссылка = ВТ_Распределение.ДокументОснование
		|ГДЕ
		|	НЕ ВТ_Распределение.ДокументОснование ЕСТЬ NULL
		|{ГДЕ
		|	Деньги.Ссылка.*,
		|	(НАЧАЛОПЕРИОДА(Деньги.Дата, ДЕНЬ)) КАК Дата,
		|	Деньги.Номер,
		|	Деньги.Проведен,
		|	Деньги.СуммаДокумента,
		|	Деньги.Валюта.*,
		|	Деньги.Контрагент.*,
		|	Деньги.ХозяйственнаяОперация.*,
		|	Деньги.Комментарий,
		|	Деньги.Подразделение.*,
		|	Деньги.Ответственный.*,
		|	Деньги.Организация.*,
		|	Деньги.БанковскийСчет.* КАК БанковскийСчетКасса,
		|	Деньги.ДатаВходящегоДокумента,
		|	Деньги.НомерВходящегоДокумента,
		|	Деньги.НазначениеПлатежа,
		|	(Деньги.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания),
		|	Деньги.ПометкаУдаления,
		|	ВТ_Распределение.ОтражениеФакта.*}";
		
		ТекстЗапросаРасшифровка = 
		"ВЫБРАТЬ
		|	РасшифровкаПлатежа.Ссылка КАК Ссылка,
		|	РасшифровкаПлатежа.Партнер КАК Партнер,
		|	РасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
		|	РасшифровкаПлатежа.ОснованиеПлатежа КАК ОснованиеПлатежа,
		|	РасшифровкаПлатежа.Сумма КАК Сумма,
		|	РасшифровкаПлатежа.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
		|	РасшифровкаПлатежа.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
		|	РасшифровкаПлатежа.СтатьяДоходов КАК СтатьяДоходов,
		|	РасшифровкаПлатежа.АналитикаДоходов КАК АналитикаДоходов,
		|	РасшифровкаПлатежа.Подразделение КАК Подразделение,
		|	РасшифровкаПлатежа.ДоговорКредитаДепозита КАК ДоговорКредитаДепозита,
		|	РасшифровкаПлатежа.АналитикаАктивовПассивов КАК АналитикаАктивовПассивов,
		|	РасшифровкаПлатежа.ДоговорЗаймаСотруднику КАК ДоговорЗаймаСотруднику,
		|	РасшифровкаПлатежа.НаправлениеДеятельности КАК НаправлениеДеятельности,
		|	РасшифровкаПлатежа.ОбъектРасчетов КАК ОбъектРасчетов,
		|	РасшифровкаПлатежа.ДоговорАренды КАК ДоговорАренды,
		|	РасшифровкаПлатежа.КурсЧислительВзаиморасчетов КАК КурсЧислительВзаиморасчетов,
		|	РасшифровкаПлатежа.КурсЗнаменательВзаиморасчетов КАК КурсЗнаменательВзаиморасчетов
		|{ВЫБРАТЬ
		|	Ссылка.*,
		|	Партнер.*,
		|	СтатьяДвиженияДенежныхСредств.*,
		|	ОснованиеПлатежа.*,
		|	Сумма,
		|	ВалютаВзаиморасчетов.*,
		|	СуммаВзаиморасчетов,
		|	СтатьяДоходов.*,
		|	АналитикаДоходов.*,
		|	Подразделение.*,
		|	ДоговорКредитаДепозита.*,
		|	АналитикаАктивовПассивов.*,
		|	ДоговорЗаймаСотруднику.*,
		|	НаправлениеДеятельности.*,
		|	ОбъектРасчетов.*,
		|	ДоговорАренды.*,
		|	КурсЧислительВзаиморасчетов,
		|	КурсЗнаменательВзаиморасчетов}
		|ИЗ
		|	Документ.ПоступлениеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК РасшифровкаПлатежа
		|{ГДЕ
		|	РасшифровкаПлатежа.Ссылка.*,
		|	РасшифровкаПлатежа.Партнер.*,
		|	РасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств.*,
		|	РасшифровкаПлатежа.ОснованиеПлатежа.*,
		|	РасшифровкаПлатежа.Сумма,
		|	РасшифровкаПлатежа.ВалютаВзаиморасчетов.*,
		|	РасшифровкаПлатежа.СуммаВзаиморасчетов,
		|	РасшифровкаПлатежа.СтатьяДоходов.*,
		|	РасшифровкаПлатежа.АналитикаДоходов.*,
		|	РасшифровкаПлатежа.Подразделение.*,
		|	РасшифровкаПлатежа.ДоговорКредитаДепозита.*,
		|	РасшифровкаПлатежа.АналитикаАктивовПассивов.*,
		|	РасшифровкаПлатежа.ДоговорЗаймаСотруднику.*,
		|	РасшифровкаПлатежа.НаправлениеДеятельности.*,
		|	РасшифровкаПлатежа.ОбъектРасчетов.*,
		|	РасшифровкаПлатежа.ДоговорАренды.*,
		|	РасшифровкаПлатежа.КурсЧислительВзаиморасчетов,
		|	РасшифровкаПлатежа.КурсЗнаменательВзаиморасчетов,
		|	РасшифровкаПлатежа.СтатьяЦелевыхСредств.*}";
		
	Иначе
		
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ФактическиеДанные.Ссылка КАК ОтражениеФакта,
		|	ФактическиеДанные.Ссылка.ДокументОснование КАК ДокументОснование
		|ПОМЕСТИТЬ ВТ_Распределение
		|ИЗ
		|	Документ.бит_ОтражениеФактаДДС.ФактическиеДанные КАК ФактическиеДанные
		|ГДЕ
		|	ФактическиеДанные.Позиция = НЕОПРЕДЕЛЕНО
		|	И ТИПЗНАЧЕНИЯ(ФактическиеДанные.Ссылка.ДокументОснование) = ТИП(Документ.ПриходныйКассовыйОрдер)
		|{ГДЕ
		|	(ФактическиеДанные.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)}
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Деньги.Ссылка КАК Ссылка,
		|	НАЧАЛОПЕРИОДА(Деньги.Дата, ДЕНЬ) КАК Дата,
		|	Деньги.Номер КАК Номер,
		|	Деньги.Проведен КАК Проведен,
		|	Деньги.СуммаДокумента КАК Сумма,
		|	Деньги.Валюта КАК Валюта,
		|	Деньги.Контрагент КАК Контрагент,
		|	Деньги.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	Деньги.Комментарий КАК Комментарий,
		|	Деньги.Подразделение КАК Подразделение,
		|	Деньги.Автор КАК Ответственный,
		|	Деньги.Организация КАК Организация,
		|	Деньги.Касса КАК БанковскийСчетКасса,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаВходящегоДокумента,
		|	"""" КАК НомерВходящегоДокумента,
		|	"""" КАК НазначениеПлатежа,
		|	ТИПЗНАЧЕНИЯ(Деньги.Ссылка) КАК Тип,
		|	Деньги.ПометкаУдаления КАК ПометкаУдаления,
		|	ВТ_Распределение.ОтражениеФакта КАК ОтражениеФакта
		|{ВЫБРАТЬ
		|	Ссылка.*,
		|	Дата,
		|	Номер,
		|	Проведен,
		|	Сумма,
		|	Валюта.*,
		|	Контрагент.*,
		|	ХозяйственнаяОперация.*,
		|	Комментарий,
		|	Подразделение.*,
		|	Ответственный.*,
		|	Организация.*,
		|	Деньги.Касса.* КАК БанковскийСчетКасса,
		|	ДатаВходящегоДокумента,
		|	НомерВходящегоДокумента,
		|	НазначениеПлатежа,
		|	Тип,
		|	ПометкаУдаления,
		|	ОтражениеФакта.*}
		|ИЗ
		|	Документ.ПриходныйКассовыйОрдер КАК Деньги
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Распределение КАК ВТ_Распределение
		|		ПО Деньги.Ссылка = ВТ_Распределение.ДокументОснование
		|ГДЕ
		|	НЕ ВТ_Распределение.ДокументОснование ЕСТЬ NULL
		|{ГДЕ
		|	Деньги.Ссылка.*,
		|	(НАЧАЛОПЕРИОДА(Деньги.Дата, ДЕНЬ)) КАК Дата,
		|	Деньги.Номер,
		|	Деньги.Проведен,
		|	Деньги.СуммаДокумента,
		|	Деньги.Валюта.*,
		|	Деньги.Контрагент.*,
		|	Деньги.ХозяйственнаяОперация.*,
		|	Деньги.Комментарий,
		|	Деньги.Подразделение.*,
		|	Деньги.Автор.*,
		|	Деньги.Организация.*,
		|	Деньги.Касса.* КАК БанковскийСчетКасса,
		|	(Деньги.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания),
		|	Деньги.ПометкаУдаления,
		|	ВТ_Распределение.ОтражениеФакта.*}";
		
		ТекстЗапросаРасшифровка = 
		"ВЫБРАТЬ
		|	РасшифровкаПлатежа.Ссылка КАК Ссылка,
		|	РасшифровкаПлатежа.Партнер КАК Партнер,
		|	РасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
		|	РасшифровкаПлатежа.ОснованиеПлатежа КАК ОснованиеПлатежа,
		|	РасшифровкаПлатежа.Сумма КАК Сумма,
		|	РасшифровкаПлатежа.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
		|	РасшифровкаПлатежа.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
		|	РасшифровкаПлатежа.СтатьяДоходов КАК СтатьяДоходов,
		|	РасшифровкаПлатежа.АналитикаДоходов КАК АналитикаДоходов,
		|	РасшифровкаПлатежа.Подразделение КАК Подразделение,
		|	РасшифровкаПлатежа.ДоговорКредитаДепозита КАК ДоговорКредитаДепозита,
		|	РасшифровкаПлатежа.АналитикаАктивовПассивов КАК АналитикаАктивовПассивов,
		|	РасшифровкаПлатежа.ДоговорЗаймаСотруднику КАК ДоговорЗаймаСотруднику,
		|	РасшифровкаПлатежа.НаправлениеДеятельности КАК НаправлениеДеятельности,
		|	РасшифровкаПлатежа.ОбъектРасчетов КАК ОбъектРасчетов,
		|	РасшифровкаПлатежа.ДоговорАренды КАК ДоговорАренды,
		|	РасшифровкаПлатежа.КурсЧислительВзаиморасчетов КАК КурсЧислительВзаиморасчетов,
		|	РасшифровкаПлатежа.КурсЗнаменательВзаиморасчетов КАК КурсЗнаменательВзаиморасчетов
		|{ВЫБРАТЬ
		|	Ссылка.*,
		|	Партнер.*,
		|	СтатьяДвиженияДенежныхСредств.*,
		|	ОснованиеПлатежа.*,
		|	Сумма,
		|	ВалютаВзаиморасчетов.*,
		|	СуммаВзаиморасчетов,
		|	СтатьяДоходов.*,
		|	АналитикаДоходов.*,
		|	Подразделение.*,
		|	ДоговорКредитаДепозита.*,
		|	АналитикаАктивовПассивов.*,
		|	ДоговорЗаймаСотруднику.*,
		|	НаправлениеДеятельности.*,
		|	ОбъектРасчетов.*,
		|	ДоговорАренды.*,
		|	КурсЧислительВзаиморасчетов,
		|	КурсЗнаменательВзаиморасчетов}
		|ИЗ
		|	Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК РасшифровкаПлатежа
		|{ГДЕ
		|	РасшифровкаПлатежа.Ссылка.*,
		|	РасшифровкаПлатежа.Партнер.*,
		|	РасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств.*,
		|	РасшифровкаПлатежа.ОснованиеПлатежа.*,
		|	РасшифровкаПлатежа.Сумма,
		|	РасшифровкаПлатежа.ВалютаВзаиморасчетов.*,
		|	РасшифровкаПлатежа.СуммаВзаиморасчетов,
		|	РасшифровкаПлатежа.СтатьяДоходов.*,
		|	РасшифровкаПлатежа.АналитикаДоходов.*,
		|	РасшифровкаПлатежа.Подразделение.*,
		|	РасшифровкаПлатежа.ДоговорКредитаДепозита.*,
		|	РасшифровкаПлатежа.АналитикаАктивовПассивов.*,
		|	РасшифровкаПлатежа.ДоговорЗаймаСотруднику.*,
		|	РасшифровкаПлатежа.НаправлениеДеятельности.*,
		|	РасшифровкаПлатежа.ОбъектРасчетов.*,
		|	РасшифровкаПлатежа.ДоговорАренды.*,
		|	РасшифровкаПлатежа.КурсЧислительВзаиморасчетов,
		|	РасшифровкаПлатежа.КурсЗнаменательВзаиморасчетов}";
		
	КонецЕсли;

	Результат = Новый Массив;
	Результат.Добавить(ТекстЗапроса);
	Результат.Добавить(ТекстЗапросаРасшифровка);
	
	Возврат Результат;

КонецФункции

&НаСервере
Процедура ИницироватьПравилаПоиска()

	ПравилаПоиска.Очистить();
	
	НоваяСтрока = ПравилаПоиска.Добавить();
	НоваяСтрока.НаборДанныхИсточник	= "НаборДанных1";
	НоваяСтрока.НаборДанныхПриемник = "НаборДанных3";
	НоваяСтрока.ВыражениеИсточник 	= "Контрагент";
	НоваяСтрока.ВыражениеПриемник 	= "ППДС.Контрагент";
	НоваяСтрока.ВидСравнения	  	= ВидСравненияКомпоновкиДанных.Равно;
	НоваяСтрока.РеквизитДокумента 	= НСтр("ru = 'Контрагент'");
	НоваяСтрока.РеквизитППДС	  	= НСтр("ru = 'Контрагент'");

	НоваяСтрока = ПравилаПоиска.Добавить();
	НоваяСтрока.НаборДанныхИсточник = "НаборДанных1";
	НоваяСтрока.НаборДанныхПриемник = "НаборДанных3";
	НоваяСтрока.ВыражениеИсточник 	= "БанковскийСчетКасса";
	НоваяСтрока.ВыражениеПриемник	= "ППДС.БанковскийСчетКасса";
	НоваяСтрока.ВидСравнения	  	= ВидСравненияКомпоновкиДанных.Равно;
	НоваяСтрока.РеквизитДокумента 	= НСтр("ru = 'Банковский счет / Касса'");
	НоваяСтрока.РеквизитППДС	  	= НСтр("ru = 'Банковский счет / Касса'");

	НоваяСтрока = ПравилаПоиска.Добавить();
	НоваяСтрока.НаборДанныхИсточник = "НаборДанных1";
	НоваяСтрока.НаборДанныхПриемник = "НаборДанных3";
	НоваяСтрока.ВыражениеИсточник 	= "Валюта";
	НоваяСтрока.ВыражениеПриемник	= "ППДС.Валюта";
	НоваяСтрока.ВидСравнения	  	= ВидСравненияКомпоновкиДанных.Равно;
	НоваяСтрока.РеквизитДокумента 	= НСтр("ru = 'Валюта'");
	НоваяСтрока.РеквизитППДС	  	= НСтр("ru = 'Валюта'");
	
	// ++ NB Подумать 
	//НоваяСтрока = ПравилаПоиска.Добавить();
	//НоваяСтрока.НаборДанныхИсточник = "НаборДанных2";
	//НоваяСтрока.НаборДанныхПриемник = "НаборДанных3";
	//НоваяСтрока.ВыражениеИсточник 	= "РасшифровкаПлатежа.ДоговорКонтрагента";
	//НоваяСтрока.ВыражениеПриемник 	= "ППДС.ДоговорКонтрагента";
	//НоваяСтрока.ВидСравнения	  	= ВидСравненияКомпоновкиДанных.Равно;
	//НоваяСтрока.РеквизитДокумента 	= НСтр("ru = 'Расшифровка платежа.Договор контрагента'");
	//НоваяСтрока.РеквизитППДС	  	= НСтр("ru = 'Договор контрагента'");
	
	НоваяСтрока = ПравилаПоиска.Добавить();
	НоваяСтрока.НаборДанныхИсточник = "НаборДанных1";
	НоваяСтрока.НаборДанныхПриемник = "НаборДанных3";
	НоваяСтрока.ВыражениеИсточник 	= "Дата";
	НоваяСтрока.ВыражениеПриемник 	= "ППДС.ДатаПоступления";
	НоваяСтрока.ВидСравнения	  	= ВидСравненияКомпоновкиДанных.Равно;
	НоваяСтрока.РеквизитДокумента 	= НСтр("ru = 'Дата'");
	НоваяСтрока.РеквизитППДС	  	= НСтр("ru = 'Дата поступления'");

	НоваяСтрока = ПравилаПоиска.Добавить();
	НоваяСтрока.НаборДанныхИсточник = "НаборДанных1";
	НоваяСтрока.НаборДанныхПриемник = "НаборДанных3";
	НоваяСтрока.ВыражениеИсточник 	= "Сумма";
	НоваяСтрока.ВыражениеПриемник 	= "ППДС.Сумма";
	НоваяСтрока.ВидСравнения	  	= ВидСравненияКомпоновкиДанных.Равно;
	НоваяСтрока.РеквизитДокумента 	= НСтр("ru = 'Сумма'");
	НоваяСтрока.РеквизитППДС	  	= НСтр("ru = 'Сумма'");

КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	// АПК:277-выкл Проектное решение вызвать функционал другой подсистемы.
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "СвязанныеДокументыПометка");
	// АПК:277-вкл
	ГруппаИ = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(ЭлементУО.Отбор,, 
					ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли); 
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаИ,
		"СвязанныеДокументы.Основной", ВидСравненияКомпоновкиДанных.Равно, Истина);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаИ,
		"СвязанныеДокументы.Обработано", ВидСравненияКомпоновкиДанных.Равно, Истина);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПодсказкуСпискаИКнопкуПоУмолчанию(Форма, Событие)

	Элементы = Форма.Элементы;
	
	КнопкиФормы = Новый Массив;
	КнопкиФормы.Добавить(Элементы.ФормаНайтиСвязанные);
	КнопкиФормы.Добавить(Элементы.ФормаПривязатьДокументы);
	
	Если Событие = "Открытие" Тогда
		ТекстСообщения = НСтр("ru = 'Задайте условия отбора и поиска и нажмите ""Найти документы"".';
								|en = 'Set the selection and search conditions and click ""Find documents"".'");
		КнопкаПоУмолчанию = Элементы.ФормаНайтиСвязанные;
	ИначеЕсли Событие = "ИзмененыПравилаОтбораИПоиска" Тогда
		ТекстСообщения = НСтр("ru = 'Заданы условия отбора и поиска. Нажмите ""Найти документы"".'; 
							|en = 'The selection and search conditions are set. Click on ""Find documents"".'");
		КнопкаПоУмолчанию = Элементы.ФормаНайтиСвязанные;
	ИначеЕсли Событие = "ВыполненПоиск" Тогда
		ТекстСообщения = НСтр("ru = 'Отметьте связанные документы и нажмите ""Привязать документы"".';
							|en = 'Mark the related documents and click ""Link documents"".'");
		КнопкаПоУмолчанию = Элементы.ФормаПривязатьДокументы;
	ИначеЕсли Событие = "ОбработкаЗавершена" Тогда
		ТекстСообщения = НСтр("ru = 'Обработка завершена. Для отбора и поиска новых документов нажмите ""Найти документы"".';
								|en = 'Processing is completed. To select and search for new documents, click ""Find documents"".'");
		КнопкаПоУмолчанию = Элементы.ФормаНайтиСвязанные;	
	КонецЕсли;

	Для каждого КнопкаФормы Из КнопкиФормы Цикл
		КнопкаФормы.КнопкаПоУмолчанию = (КнопкаФормы = КнопкаПоУмолчанию);
		КнопкаФормы.Видимость		  = (КнопкаФормы = КнопкаПоУмолчанию);
	КонецЦикла;
	
	Элементы.ФормаСнятьПометки.Видимость 	  = (Событие <> "ОбработкаЗавершена");
	Элементы.ФормаОбновитьДокументы.Видимость = (Событие = "ВыполненПоиск");
	
	Элементы.СвязанныеДокументы.РасширеннаяПодсказка.Заголовок = ТекстСообщения;
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьСвязанныеДокументыИерархически(Знач СтрокаДанных = Неопределено)
	
	Если СтрокаДанных <> Неопределено Тогда
		Элементы.СвязанныеДокументы.Развернуть(СтрокаДанных, Истина);
		Возврат;
	КонецЕсли;
	
	// Все первого уровня
	ВсеСтроки = Элементы.СвязанныеДокументы;
	Для Каждого ДанныеСтроки Из СвязанныеДокументы.ПолучитьЭлементы() Цикл 
		ВсеСтроки.Развернуть(ДанныеСтроки.ПолучитьИдентификатор(), Истина);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьСвязанныеДокументыИерархически(Знач СтрокаДанных = Неопределено)
	
	Если СтрокаДанных <> Неопределено Тогда
		Элементы.СвязанныеДокументы.Свернуть(СтрокаДанных);
		Возврат;
	КонецЕсли;
	
	// Все первого уровня
	ВсеСтроки = Элементы.СвязанныеДокументы;
	Для Каждого ДанныеСтроки Из СвязанныеДокументы.ПолучитьЭлементы() Цикл 
		ВсеСтроки.Свернуть(ДанныеСтроки.ПолучитьИдентификатор());
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеДокументыПриАктивизацииСтрокиОжидание()

	ТекущиеДанные = Элементы.СвязанныеДокументы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РазвернутьСвязанныеДокументыИерархически(ТекущиеДанные.ПолучитьИдентификатор());	

КонецПроцедуры

&НаКлиенте
Процедура СнятьПометкиИерархически(Коллекция)

	Для каждого СтрокаТаблицы Из Коллекция Цикл
		СтрокаТаблицы.Пометка = Ложь;
		СнятьПометкиИерархически(СтрокаТаблицы.ПолучитьЭлементы());
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
